# Decision tree based model

In [1]:
import pandas as pd 
path="C:\\Users\\mf879\\OneDrive\\Desktop\\Karunadu\\Data\\Data\\salaries.csv"

In [2]:
data=pd.read_csv(path)

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                16 non-null     object
 1   job                    16 non-null     object
 2   degree                 16 non-null     object
 3   salary_more_then_100k  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 640.0+ bytes

# Important note 
We have to replace the object to int in order to perform the machince learning model so we use the __LableEncoder__ of the sklearn.preprocessing model to do this we can use the number format to do the analysis

In [4]:
data.isnull().sum()

company                  0
job                      0
degree                   0
salary_more_then_100k    0
dtype: int64

In [5]:
data

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [6]:
import sklearn
from sklearn.preprocessing import LabelEncoder

In [8]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()
data['company_new']=le_company.fit_transform(data['company'])
data['job_new']=le_job.fit_transform(data['job'])
data['degree_new']=le_degree.fit_transform(data['degree'])

In [9]:
print(data)

       company                  job     degree  salary_more_then_100k  \
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

    company_new  job_new  degree_new
0             2        2           0
1             2        2           1
2             2        0           0
3             2        0           1
4             2        1           0
5             2        1           1
6             0        2           1
7             0        1           0
8             0        0           0
9             0        0           1
10            1        2           0
11            1        2           1
12            1        0           0
13            1        0           1
14            1        1           0
15            1        1           1

In [11]:
inputs=data.drop(['company','job','degree','salary_more_then_100k'],'columns')
outputs=data.drop(['company','company_new','job','job_new','degree','degree_new'],'columns')

C:\Users\mf879\AppData\Local\Temp\ipykernel_15716\2023567009.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  inputs=data.drop(['company','job','degree','salary_more_then_100k'],'columns')
C:\Users\mf879\AppData\Local\Temp\ipykernel_15716\2023567009.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  outputs=data.drop(['company','company_new','job','job_new','degree','degree_new'],'columns')

In [12]:
inputs

    company_new  job_new  degree_new
0             2        2           0
1             2        2           1
2             2        0           0
3             2        0           1
4             2        1           0
5             2        1           1
6             0        2           1
7             0        1           0
8             0        0           0
9             0        0           1
10            1        2           0
11            1        2           1
12            1        0           0
13            1        0           1
14            1        1           0
15            1        1           1

In [13]:
outputs

    salary_more_then_100k
0                       0
1                       0
2                       1
3                       1
4                       0
5                       1
6                       0
7                       0
8                       0
9                       1
10                      1
11                      1
12                      1
13                      1
14                      1
15                      1

In [14]:
import sklearn 
from sklearn.model_selection import train_test_split

In [15]:
x_train,x_test,y_train,y_test=train_test_split(inputs,outputs,test_size=0.2)

In [16]:
x_train

    company_new  job_new  degree_new
9             0        0           1
3             2        0           1
1             2        2           1
7             0        1           0
0             2        2           0
4             2        1           0
14            1        1           0
11            1        2           1
15            1        1           1
12            1        0           0
5             2        1           1
6             0        2           1

In [17]:
x_test

    company_new  job_new  degree_new
2             2        0           0
13            1        0           1
10            1        2           0
8             0        0           0

In [18]:
y_train

    salary_more_then_100k
9                       1
3                       1
1                       0
7                       0
0                       0
4                       0
14                      1
11                      1
15                      1
12                      1
5                       1
6                       0

In [19]:
y_test

    salary_more_then_100k
2                       1
13                      1
10                      1
8                       0

In [21]:
from sklearn import tree 
model=tree.DecisionTreeClassifier()
model.fit(inputs,outputs)

DecisionTreeClassifier()

## if 0 then salary<100k if 1 salary>100k

input is given in the form of LeableEncoder first is the value of the company then the value of the job and degree

In [33]:
result=model.predict([[2,2,0]]) 
print(result)

[0]

C:\Users\mf879\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

In [34]:
result=model.predict([[2,0,1]])
print(result)

[1]

C:\Users\mf879\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

In [35]:
if result==0:
    print('Salary less than 100k')
else:
    print('Salary more than 100k')

Salary more than 100k